system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)		// 0
    (0.15 0 0)		// 1
    (0.15 1 0)		// 2
    (0 1 0)		// 3
    (0 0 0.1)		// 4
    (0.15 0 0.1)	// 5
    (0.15 1 0.1)	// 6
    (0 1 0.1)		// 7
    
    
    (0 1 0)		// 3
    (0 1 0.1)		// 7
    (0.05 1 0.1)	// 6
    (0.05 1 0)		// 2
    
    

    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 500 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    sym
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }
);


// ************************************************************************* //
