constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          75;
        startFace       74425;
    }
    bottom
    {
        type            patch;
        nFaces          75;
        startFace       74500;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       74575;
    }
    sym
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          500;
        startFace       75075;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          75000;
        startFace       75575;
    }
)

// ************************************************************************* //
